Revit 2024 API
BuiltInFailures.StairRampFailures.WinderSecondLegTooShortOrRunwidthTooGreatFailure Property
 The second leg of winder run is too short or the runwidth is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WinderSecondLegTooShortOrRunwidthTooGreatFailure { get; }
Visual Basic
Public Shared ReadOnly Property WinderSecondLegTooShortOrRunwidthTooGreatFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WinderSecondLegTooShortOrRunwidthTooGreatFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace